In [23]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To':['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})
#df1=df.copy()

In [24]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [42]:
index1 = df['FlightNumber'].index[df['FlightNumber'].apply(np.isnan)]
df['FlightNumber'].fillna(value=df['FlightNumber'][0]+10, limit=1, inplace=True)
df['FlightNumber'].fillna(value=df['FlightNumber'][2]+10, limit=1, inplace=True)
df['FlightNumber']=df['FlightNumber'].apply(lambda x:int(x))

# 2,4

In [26]:
df1=df.copy()

In [27]:
df1['From']=df1['From_To'].apply(lambda x:x.split("_"))
df1['To']=df1['From'].apply(lambda x:x[1])
df1['From']=df1['From'].apply(lambda x:x[0])

In [28]:
df=df1.drop('From_To',axis=1,inplace=True)
df1

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

# 3

In [29]:
def standardize(x):
    return x.capitalize()
df1['From']=df1['From'].apply(standardize)
df1['To']=df1['To'].apply(standardize)

In [30]:
df=pd.concat([df,df1],axis=1)

In [31]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

# 5

In [35]:
def assign(x):
    if(len(x)>=1):
        return int(x[0])
    else:
        return np.nan
    
def assign1(x):
    if(len(x)>=2):
        return int(x[1])
    else:
        return np.nan

    
def assign2(x):
    if(len(x)>=3):
        return int(x[2])
    else:
        return np.nan


df['delay_1']=df['RecentDelays'].apply(assign)
df['delay_2']=df['RecentDelays'].apply(assign1)
df['delay_3']=df['RecentDelays'].apply(assign2)

In [38]:
df['delays']=df['RecentDelays']
df.drop('RecentDelays',axis=1,inplace=True)

In [40]:
df['FlightNumber']=df['FlightNumber'].apply(lambda x:int(x))

In [41]:
df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3,delays
0,10045,KLM(!),London,Paris,23.0,47.0,NaN,"[23, 47]"
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN,[]
2,10065,(British Airways. ),London,Stockholm,24.0,43.0,87.0,"[24, 43, 87]"
3,10075,12. Air France,Budapest,Paris,13.0,NaN,NaN,[13]
4,10085,"""Swiss Air""",Brussels,London,67.0,32.0,NaN,"[67, 32]"